[
    {
        "id": 0,
        "type": "smartphone",
        "mod": "default",
        "brand": "samsung",
        "model": "galaxy s21 ultra",
        "price": 117799,
        "images": [
            "cat0-item00/01.png",
            "cat0-item00/02.png",
            "cat0-item00/03.png",
            "cat0-item00/04.png",
            "cat0-item00/05.png"
        ],
        "desc": "Смартфон Samsung Galaxy S21 Ultra с диагональю 6.8'' оборудован четырехмодульной камерой 108+12+10+10 Мп, которая превращает устройство в настоящую киностудию. Она позволяет снимать видео в качестве 8К, превращая на ходу каждый кадр в снимок. Модель выполнена полностью в стеклянном корпусе, защищенном покрытием Corning Gorilla Glass Victus, которое обладает устойчивостью к статическим нагрузкам и царапинам. Емкости аккумулятора 5000 мА·ч хватит на весь день даже при активном пользовании сетями 4G. 512 ГБ памяти позволяют хранить в памяти многочисленные воспоминания в виде фото и видео. Процессор Exynos 2100 с восьмиядерной конфигурацией, используемый в Samsung Galaxy S21 Ultra, характеризуется быстродействием и производительностью на более высоком уровне. Благодаря этому искусственный интеллект будет задействован в работе всех режимов и систем. Функция «Samsung Knox Vault» позволяет защитить устройство на аппаратном уровне, гарантируя, при этом, конфиденциальность доступа к приложениям и данных.",
        "spec": {
            "cpu": "Exynos 2100 x8",
            "ram": "16",
            "storage": "512",
            "year": 2020,
            "color": "серебристый",
            "screen": "D-AMOLED 2X 6.8'",
            "material": "металл",
            "OC": "Android 11",
            "camera": "108+12+10+10",
            "sizes": [
                75.6, 165.1, 8.9
            ],
            "accum": 5000,
            "IP": "68",
            "weight": 500
        }
    },
    {
        "id": 1,
        "type": "notebook",
        "mod": "game",
        "brand": "asus",
        "model": "rog strix scar",
        "price": 139999,
        "images": [
            "cat1-item00/01.png",
            "cat1-item00/02.png",
            "cat1-item00/03.png",
            "cat1-item00/04.png",
            "cat1-item00/05.png",
            "cat1-item00/06.png",
        ],
        "desc": "Оптико-механическая клавиатура обеспечивает точное управление, а мощные компоненты – процессор AMD Ryzen 7 5800H и видеокарта GeForce RTX 3060 –гарантируют качественное изображение на дисплее. Игровая платформа с отличными характеристиками – твое преимущество в любой схватке! Эффективное охлаждение включает в себя множество элементов. Для быстрого отвода тепла от процессора применяется инновационный термоинтерфейс – жидкий металл. 84-лопастные вентиляторы перемещают больше воздуха при меньшей турбулентности. Воздушный поток проходит сквозь четыре радиатора и выбрасывается наружу через оптимально расположенные вентиляционные отверстия. Все это позволяет функции ROG Boost ускорять видеокарту в режиме Turbo, а также дает пользователю возможность дополнительно разгонять как графический, так и центральный процессоры. Настройки системы охлаждения можно задавать отдельно для любого приложения, чтобы они применялись автоматически при его запуске. Встроенная акустическая система ноутбука, состоящая из четырех динамиков, умеет создавать эффект 5.1.2-канального иммерсивного звучания на базе технологии Dolby Atmos, позволяя полностью погрузиться в то, что происходит на экране. Два высокочастотных динамика направлены непосредственно на пользователя, а пара низкочастотных направляют звуковую волну вниз, чтобы та отражалась от поверхности стола. Для повышения качества голосовой связи служит технология двухстороннего интеллектуального шумоподавления.",
        "spec": {
            "cpu": "amd ryzen 7 5800h",
            "ram": "16",
            "videocard": [
                "nvidia", "GeForce RTX 3060"
            ],
            "storage": [
                ["ssd", "-", 512]
            ],
            "year": 2020,
            "color": "чёрный",
            "screen": "IPS 15.6'' 1920x1080",
            "material": "металл/пластик",
            "OC": "dos",
            "camera": "-",
            "sizes": [
                259, 354, 27.2
            ],
            "accum": 90,
            "weight": 2300
        }
    },
    {
        "id": 2,
        "type": "computer",
        "mod": "game",
        "brand": "zet",
        "model": "ward h062",
        "price": 91990,
        "images": [
            "cat2-item00/01.png",
            "cat2-item00/02.png",
            "cat2-item00/03.png"
        ],
        "desc": "ПК ZET Gaming WARD H062 представлен в форм-факторе Tower и имеет классическую черную расцветку корпуса. Лаконичный дизайн и оптимальная производительность делают данную модель подходящей для любого геймера. Процессор в компьютере представлен 6-ядерной моделью Intel Core i5 10400F с трехуровневым кэшем и тактовой частотой 2900 МГц. Для быстродействия при работе в многозадачном режиме имеется 16 ГБ оперативной памяти. ПК ZET Gaming WARD H062 оснащен SSD-накопителем с 500 ГБ объема доступной памяти. Для подключения мониторов предусмотрено три видеоразъема: DVI, DisplayPort и HDMI, а для различной периферии и аудиотехники имеются два порта USB 2.0, интерфейсы USB 3.2 Gen1 Type-A и аудиоразъемы jack 3.5 mm. Устройство не имеет предустановленной ОС, благодаря чему пользователю предоставляется возможность выбора и установки наиболее удобной для него операционной системы.",
        "spec": {
            "cpu": "intel i5 10400f",
            "ram": "16",
            "videocard": [
                "nvidia", "GeForce RTX 2060"
            ],
            "storage": [
                ["ssd", "Samsung 870 EVO", 500]
            ],
            "color": "чёрный",
            "OC": "",
            "sizes": [
                430, 210, 430
            ],
            "cooler": "DEEPCOOL GAMMAXX 400 BL",
            "power": "Cougar VTE 600W ",
            "case": "ZET GAMING Rare Minicase MS1"
        }
    }
    
]