var DATABASE = [
    {
        "id": 0,
        "type": "smartphone",
        "mod": "default",
        "brand": "samsung",
        "model": "galaxy s21 ultra",
        "price": 117799,
        "images": [
            "cat0-item00/01.png",
            "cat0-item00/02.png",
            "cat0-item00/03.png",
            "cat0-item00/04.png",
            "cat0-item00/05.png"
        ],
        "desc": "Смартфон Samsung Galaxy S21 Ultra с диагональю 6.8'' оборудован четырехмодульной камерой 108+12+10+10 Мп, которая превращает устройство в настоящую киностудию. Она позволяет снимать видео в качестве 8К, превращая на ходу каждый кадр в снимок. Модель выполнена полностью в стеклянном корпусе, защищенном покрытием Corning Gorilla Glass Victus, которое обладает устойчивостью к статическим нагрузкам и царапинам. Емкости аккумулятора 5000 мА·ч хватит на весь день даже при активном пользовании сетями 4G. 512 ГБ памяти позволяют хранить в памяти многочисленные воспоминания в виде фото и видео. Процессор Exynos 2100 с восьмиядерной конфигурацией, используемый в Samsung Galaxy S21 Ultra, характеризуется быстродействием и производительностью на более высоком уровне. Благодаря этому искусственный интеллект будет задействован в работе всех режимов и систем. Функция «Samsung Knox Vault» позволяет защитить устройство на аппаратном уровне, гарантируя, при этом, конфиденциальность доступа к приложениям и данных.",
        "spec": {
            "cpu": [
                "exynos", "2100 x8"
            ],
            "ram": "16",
            "storage": "512",
            "year": 2020,
            "color": "серебристый",
            "screen": "D-AMOLED 2X 6.8'",
            "material": "металл",
            "OC": "Android 11",
            "camera": "108+12+10+10",
            "sizes": [
                75.6, 165.1, 8.9
            ],
            "accum": 5000,
            "IP": "68",
            "weight": 500
        }
    },
    {
        "id": 1,
        "type": "notebook",
        "mod": "game",
        "brand": "asus",
        "model": "rog strix scar",
        "price": 139999,
        "images": [
            "cat1-item00/01.png",
            "cat1-item00/02.png",
            "cat1-item00/03.png",
            "cat1-item00/04.png",
            "cat1-item00/05.png",
            "cat1-item00/06.png",
        ],
        "desc": "Оптико-механическая клавиатура обеспечивает точное управление, а мощные компоненты – процессор AMD Ryzen 7 5800H и видеокарта GeForce RTX 3060 –гарантируют качественное изображение на дисплее. Игровая платформа с отличными характеристиками – твое преимущество в любой схватке! Эффективное охлаждение включает в себя множество элементов. Для быстрого отвода тепла от процессора применяется инновационный термоинтерфейс – жидкий металл. 84-лопастные вентиляторы перемещают больше воздуха при меньшей турбулентности. Воздушный поток проходит сквозь четыре радиатора и выбрасывается наружу через оптимально расположенные вентиляционные отверстия. Все это позволяет функции ROG Boost ускорять видеокарту в режиме Turbo, а также дает пользователю возможность дополнительно разгонять как графический, так и центральный процессоры. Настройки системы охлаждения можно задавать отдельно для любого приложения, чтобы они применялись автоматически при его запуске. Встроенная акустическая система ноутбука, состоящая из четырех динамиков, умеет создавать эффект 5.1.2-канального иммерсивного звучания на базе технологии Dolby Atmos, позволяя полностью погрузиться в то, что происходит на экране. Два высокочастотных динамика направлены непосредственно на пользователя, а пара низкочастотных направляют звуковую волну вниз, чтобы та отражалась от поверхности стола. Для повышения качества голосовой связи служит технология двухстороннего интеллектуального шумоподавления.",
        "spec": {
            "cpu": [
                "amd", "ryzen 7 5800h"
            ],
            "ram": "16",
            "videocard": [
                "nvidia", "GeForce RTX 3060"
            ],
            "storage": [
                ["ssd", "-", 512]
            ],
            "year": 2020,
            "color": "чёрный",
            "screen": "IPS 15.6'' 1920x1080",
            "material": "металл/пластик",
            "OC": "dos",
            "camera": "-",
            "sizes": [
                259, 354, 27.2
            ],
            "accum": 90,
            "weight": 2300
        }
    },
    {
        "id": 2,
        "type": "computer",
        "mod": "game",
        "brand": "zet",
        "model": "ward h062",
        "price": 91990,
        "images": [
            "cat2-item00/01.png",
            "cat2-item00/02.png",
            "cat2-item00/03.png"
        ],
        "desc": "ПК ZET Gaming WARD H062 представлен в форм-факторе Tower и имеет классическую черную расцветку корпуса. Лаконичный дизайн и оптимальная производительность делают данную модель подходящей для любого геймера. Процессор в компьютере представлен 6-ядерной моделью Intel Core i5 10400F с трехуровневым кэшем и тактовой частотой 2900 МГц. Для быстродействия при работе в многозадачном режиме имеется 16 ГБ оперативной памяти. ПК ZET Gaming WARD H062 оснащен SSD-накопителем с 500 ГБ объема доступной памяти. Для подключения мониторов предусмотрено три видеоразъема: DVI, DisplayPort и HDMI, а для различной периферии и аудиотехники имеются два порта USB 2.0, интерфейсы USB 3.2 Gen1 Type-A и аудиоразъемы jack 3.5 mm. Устройство не имеет предустановленной ОС, благодаря чему пользователю предоставляется возможность выбора и установки наиболее удобной для него операционной системы.",
        "spec": {
            "cpu": [
                "intel", "i5 10400f"
            ],
            "motherboard": [
                "", ""
            ],
            "ram": "16",
            "videocard": [
                "nvidia", "GeForce RTX 2060"
            ],
            "storage": [
                ["ssd", "Samsung 870 EVO", 500]
            ],
            "color": "чёрный",
            "OC": "",
            "sizes": [
                430, 210, 430
            ],
            "cooler": [
                "DEEPCOOL", "GAMMAXX 400 BL"
            ],
            "power": [
                "Cougar", "VTE 600W"
            ],
            "case": [
                "ZET", "GAMING Rare Minicase MS1"
            ]
        }
    },
    {
        "id": 3,
        "type": "smartphone",
        "mod": "default",
        "brand": "samsung",
        "model": "galaxy s21 ultra",
        "price": 109999,
        "images": [
            "cat0-item01/11.png",
            "cat0-item01/12.png",
            "cat0-item01/13.png",
            "cat0-item01/14.png",
            "cat0-item01/15.png",
            "cat0-item01/16.png"
        ],
        "desc": "Смартфон Samsung Galaxy Note 20 Ultra с памятью 512 ГБ позволяет хранить неограниченное количество фотографий и видео, а также устанавливать различные приложения для игр и работы. Два слота для SIM-карт помогут выбрать оптимальные тарифы операторов. Корпус коричневого цвета изготовлен из долговечного и ударопрочного металла. Устройство имеет высокий уровень защиты и выдерживает погружение на глубину. Смартфон Samsung Galaxy Note 20 Ultra оснащен экраном диагональю 6.9 дюйма для комфортного просмотра контента. Дисплей Dynamic AMOLED передает естественные цвета и детализированное изображение в разрешении 3088x1440 пикселей. Модель оснащена точным сенсором, для управления в комплекте предусмотрен стилус. Устройство имеет камеру с несколькими сенсорами, которые снижают искажения и позволяют передать естественные оттенки при любом уровне освещенности. Смартфон с беспроводной зарядкой имеет различные датчики для комфортной эксплуатации и защиты личных данных.",
        "spec": {
            "cpu": [
                "exynos", "990 x8"
            ],
            "ram": "12",
            "storage": "512",
            "year": 2020,
            "color": "коричневый",
            "screen": "D-AMOLED 6.9'",
            "material": "металл",
            "OC": "Android 11",
            "camera": "108+12+10+10",
            "sizes": [
                77.2, 162.3, 7.9
            ],
            "accum": 4500,
            "IP": "68",
            "weight": 208
        }
    },
    {
        "id": 4,
        "type": "smartphone",
        "mod": "default",
        "brand": "huawei",
        "model": "Mate 40 Pro",
        "price": 89999,
        "images": [
            "cat0-item02/21.png",
            "cat0-item02/22.png",
            "cat0-item02/23.png",
            "cat0-item02/24.png",
            "cat0-item02/25.png"
        ],
        "desc": "Сотрите визуальные границы. Откройте для себя неизведанный мир, не ограничивайте свое воображение. Отправляйтесь навстречу будущему с небывалой скоростью. Воспользуйтесь интеллектуальными возможностями и инновационными технологиями HUAWEI Mate 40 Pro.",
        "spec": {
            "cpu": [
                "huawei", "kirin 9000 x8"
            ],
            "ram": "8",
            "storage": "256",
            "year": 2020,
            "color": "серебристый",
            "screen": "OLED 6.76",
            "material": "металл",
            "OC": "Android 10",
            "camera": "50+20+12",
            "sizes": [
                75.5, 162.9, 9.1
            ],
            "accum": 4400,
            "IP": "68",
            "weight": 212
        }
    },
    {
        "id": 5,
        "type": "smartphone",
        "mod": "game",
        "brand": "asus",
        "model": "ROG Phone 5",
        "price": 89999,
        "images": [
            "cat0-item03/31.png",
            "cat0-item03/32.png",
            "cat0-item03/33.png",
            "cat0-item03/34.png",
            "cat0-item03/35.png",
            "cat0-item03/36.png",
            "cat0-item03/37.png"
        ],
        "desc": "Играйте без компромиссов – с подлинно геймерским смартфоном ASUS ROG Phone 5! Работающий на базе мощнейшей мобильной платформы Qualcomm Snapdragon 888 5G, этот футуристический смартфон может похвастать скоростным дисплеем (144 Гц / 1 мс), аккумулятором огромной емкости (6000 мА·ч), улучшенными сенсорами AirTrigger 5 и культовой аудиосистемой GameFX. ASUS ROG Phone 5 – это смартфон мечты. Для тех, кто не боится мечтать. Мобильная платформа Qualcomm Snapdragon 888 5G – это совершенный уровень производительности. Благодаря выросшей на целых 35% скорости рендеринга, она легко обеспечивает плавную работу даже самых требовательных трехмерных игр при максимальных настройках качества изображения. Уже известный пользователям X-режим теперь реализован в приложении Armoury Crate: множество предустановленных профилей и изменяемых параметров позволяют моментально адаптировать смартфон ASUS ROG Phone 5 к текущей задаче. Мобильные игры выглядят на ASUS ROG Phone 5 невероятно красиво благодаря великолепному AMOLED-дисплею от Samsung с точной цветопередачей и превосходными скоростными характеристиками: частота обновления – 144 Гц, время отклика – 1 мс. Невероятно отзывчивый сенсорный интерфейс (частота опроса – 300 Гц, латентность – 24.3 мс) позволит быстрее реагировать на все игровые события. Дисплей поддерживает технологию Always-on HDR7, улучшающую отображение обычного контента (не в формате HDR), и покрыт прочным защитным стеклом Corning Gorilla Glass Victus.",
        "spec": {
            "cpu": [
                "qualcomm", "snapdragon 888"
            ],
            "ram": "16",
            "storage": "256",
            "year": 2021,
            "color": "чёрный",
            "screen": "AMOLED 6.78",
            "material": "металл",
            "OC": "Android 11",
            "camera": "64+13+5",
            "sizes": [
                77, 173, 9.9
            ],
            "accum": 6000,
            "IP": "68",
            "weight": 239
        }
    },
    {
        "id": 6,
        "type": "notebook",
        "mod": "game",
        "brand": "asus",
        "model": "rog strix scar super",
        "price": 149999,
        "images": [
            "cat1-item00/01.png",
            "cat1-item00/02.png",
            "cat1-item00/03.png",
            "cat1-item00/04.png",
            "cat1-item00/05.png",
            "cat1-item00/06.png"
        ],
        "desc": "Оптико-механическая клавиатура обеспечивает точное управление, а мощные компоненты – процессор AMD Ryzen 7 5800H и видеокарта GeForce RTX 3060 –гарантируют качественное изображение на дисплее. Игровая платформа с отличными характеристиками – твое преимущество в любой схватке! Эффективное охлаждение включает в себя множество элементов. Для быстрого отвода тепла от процессора применяется инновационный термоинтерфейс – жидкий металл. 84-лопастные вентиляторы перемещают больше воздуха при меньшей турбулентности. Воздушный поток проходит сквозь четыре радиатора и выбрасывается наружу через оптимально расположенные вентиляционные отверстия. Все это позволяет функции ROG Boost ускорять видеокарту в режиме Turbo, а также дает пользователю возможность дополнительно разгонять как графический, так и центральный процессоры. Настройки системы охлаждения можно задавать отдельно для любого приложения, чтобы они применялись автоматически при его запуске. Встроенная акустическая система ноутбука, состоящая из четырех динамиков, умеет создавать эффект 5.1.2-канального иммерсивного звучания на базе технологии Dolby Atmos, позволяя полностью погрузиться в то, что происходит на экране. Два высокочастотных динамика направлены непосредственно на пользователя, а пара низкочастотных направляют звуковую волну вниз, чтобы та отражалась от поверхности стола. Для повышения качества голосовой связи служит технология двухстороннего интеллектуального шумоподавления.",
        "spec": {
            "cpu": [
                "amd", "ryzen 7 5800h"
            ],
            "ram": "16",
            "videocard": [
                "nvidia", "GeForce RTX 3060"
            ],
            "storage": [
                ["ssd", "н/д", 512]
            ],
            "year": 2021,
            "color": "чёрный",
            "screen": "IPS 15.6'' 1920x1080",
            "material": "металл/пластик",
            "OC": "DOS",
            "camera": "",
            "sizes": [
                259, 354, 27.2
            ],
            "accum": 90,
            "weight": 2300
        }
    },
    {
        "id": 7,
        "type": "notebook",
        "mod": "game",
        "brand": "acer",
        "model": "Predator Triton 300S",
        "price": 12999,
        "images": [
            "cat1-item02/21.png",
            "cat1-item02/22.png",
            "cat1-item02/23.png",
            "cat1-item02/24.png",
            "cat1-item02/25.png",
            "cat1-item02/26.png",
            "cat1-item02/27.png",
            "cat1-item02/28.png"
        ],
        "desc": "Ноутбук Acer Predator Triton 300S PT314-51s-52X6 относится к моделям игровой линейки, поэтому предлагает мощный вычислительный потенциал и все необходимое для увлекательного гейминга. Аппаратная платформа с процессором Intel Core i5 11300H, 16 ГБ памяти ОЗУ и дискретным графическим адаптером nVidia GeForce RTX 3060 гарантирует стабильную работу системы. Под размещение данных предлагается накопитель SSD емкостью 1024 ГБ. Ноутбук Acer Predator Triton 300S PT314-51s-52X6 выполнен в металлическом корпусе. На экране диагональю 14 дюйма стандарта FullHD воспроизводится четкая и насыщенная картинка. Благодаря частоте обновления 144 Гц достигается плавная передача динамичной графики. Для повышения комфорта установлена клавиатура с подсветкой символов. Среди других особенностей игрового ноутбука отмечаются акустическая система DTS:X Ultra, востребованные средства проводной и беспроводной связи, сканер отпечатка пальцев, до 10 часов автономной работы.",
        "spec": {
            "cpu": [
                "intel", "i5 11300h"
            ],
            "ram": "16",
            "videocard": [
                "nvidia", "GeForce RTX 3060"
            ],
            "storage": [
                ["ssd", "н/д", 1024]
            ],
            "year": 2021,
            "color": "серебристый",
            "screen": "IPS 14'' 1920x1080",
            "material": "металл",
            "OC": "DOS",
            "camera": "",
            "sizes": [
                228, 323, 17.9
            ],
            "accum": 60,
            "weight": 1700
        }
    },
    {
        "id": 8,
        "type": "notebook",
        "mod": "game",
        "brand": "hp",
        "model": "omen 15",
        "price": 89999,
        "images": [
            "cat1-item03/31.png",
            "cat1-item03/32.png",
            "cat1-item03/33.png",
            "cat1-item03/34.png",
            "cat1-item03/35.png",
            "cat1-item03/36.png",
            "cat1-item03/37.png",
            "cat1-item03/38.png"
        ],
        "desc": "Это компактное устройство предоставит тебе невероятные возможности для самой захватывающей игры. Несмотря на компактный корпус, OMEN 15 оснащен мощным процессором Intel и видеокартой NVIDIA. А как тебе быстрый экран и длительное время автономной работы? Да, в нем предусмотрено все, а с OMEN Command Center ты получишь еще больше возможностей. Так что просто наслаждайся игрой и не удивляйся завистливым взглядам, они неизбежны.",
        "spec": {
            "cpu": [
                "intel", "i7 10750h"
            ],
            "ram": "16",
            "videocard": [
                "nvidia", "GeForce RTX 3060"
            ],
            "storage": [
                ["ssd", "н/д", 1024]
            ],
            "year": 2020,
            "color": "чёрный",
            "screen": "IPS 15.6'' 1920x1080",
            "material": "металл",
            "OC": "DOS",
            "camera": "",
            "sizes": [
                239.7, 357.9, 22.9
            ],
            "accum": 71,
            "weight": 2450
        }
    },
    {
        "id": 9,
        "type": "computer",
        "mod": "game",
        "brand": "asus",
        "model": "G35DX-RU010D",
        "price": 169999,
        "images": [
            "cat2-item02/21.png",
            "cat2-item02/22.png",
            "cat2-item02/23.png",
            "cat2-item02/24.png"
        ],
        "desc": "Мощный компьютер ASUS ROG Strix G35DX поможет каждому в покорении игровых миров. Он выдает высокую скорость в любых играх и профессиональных приложениях за счет мощной конфигурации, которая включает в себя видеокарту NVIDIA GeForce RTX 3070 и 8-ядерный процессор AMD Ryzen 7 3700X. Высокая производительность сочетается в нем с практичностью в деталях. Корпус компьютера снабжен удобной ручкой для переноски, два отсека для твердотельных накопителей поддерживают «горячую» замену устройств, а технология Keystone II служит для моментальной загрузки персонализированных системных настроек.",
        "spec": {
            "cpu": [
                "amd", "Ryzen 7 3700X"
            ],
            "motherboard": [
                "amd", "x570"
            ],
            "ram": "16",
            "videocard": [
                "nvidia", "GeForce GTX 1650"
            ],
            "storage": [
                ["ssd", "н/д", 2048],
                ["hdd", "н/д", 2048]
            ],
            "color": "чёрный",
            "OC": "DOS",
            "sizes": [
                433,279,501
            ],
            "cooler": [
                "", "н/д"
            ],
            "power": [
                "", "н/д"
            ],
            "case": [
                "asus", "ROG Tower 5"
            ]
        }
    },
    {
        "id": 10,
        "type": "computer",
        "mod": "game",
        "brand": "lenovo",
        "model": "IdeaCentre G5 14IMB05",
        "price": 84999,
        "images": [
            "cat2-item03/31.png",
            "cat2-item03/32.png",
            "cat2-item03/33.png",
            "cat2-item03/34.png"
        ],
        "desc": "ПК Lenovo IdeaCentre G5 14IMB05 [90N900ACRS] в привлекательном корпусе форм-фактора Slim способен стать залогом победы в компьютерных играх и значительного прогресса при работе с графическими программами. Для этого он имеет «мощный» процессор Intel Core i5 10400, дополненный видеокартами Nvidia GeForce GTX 1660 SUPER и Intel UHD Graphics 630, а также 16 ГБ оперативной памяти. Дополняет эту «начинку» SSD-накопитель на 512 ГБ. Думаете, это все? Также ПК Lenovo IdeaCentre G5 14IMB05 [90N900ACRS] укомплектован целым набором портов и интерфейсов для подключения всевозможных устройств (DisplayPort –2 шт, HDMI – 2 шт, VGA (D-Sub), USB 2.0 – 4 шт, USB 3.0 – 2 шт, USB Type-C, jack 3.5 mm – 2 шт. К нему можно присоединить флеш-накопители, мониторы, игровые мышь и клавиатуру, наушники. Благодаря такой обширной конфигурации вы соберете мощный геймерский компьютер.",
        "spec": {
            "cpu": [
                "intel", "i5 10400"
            ],
            "motherboard": [
                "intel", "B460"
            ],
            "ram": "16",
            "videocard": [
                "nvidia", "GeForce GTX 1650"
            ],
            "storage": [
                ["ssd", "н/д", 2048]
            ],
            "color": "чёрный",
            "OC": "DOS",
            "sizes": [
                292.2,145,365
            ],
            "cooler": [
                "", "н/д"
            ],
            "power": [
                "", "н/д"
            ],
            "case": [
                "ideacentre", "Slim 490"
            ]
        }
    }
];

function getUrlVars() {
    var vars = {};
    var parts = window.location.href.replace(
        /[?&]+([^=&]+)=([^&]*)/gi,
        function(m,key,value) {
            vars[key] = value;
        }
    );
    return vars;
}